# 11-1 데이터 집계

In [1]:
import pandas as pd
df = pd.read_csv('./datas/data/gapminder.tsv', sep = '\t')

In [2]:
# year열을 기준으로 데이터 그룹화 한후에 lifeExp열의 평균을 구함
avg_life_exp_by_year = df.groupby('year').lifeExp.mean()
avg_life_exp_by_year

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [3]:
# year열의 데이터 중 중복없이 추출한것
years = df.year.unique()
years

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007], dtype=int64)

In [4]:
y1952 = df.loc[df.year==1952, :]
y1952_mean = y1952.lifeExp.mean()
y1952_mean

49.057619718309866

In [5]:
y1957 = df.loc[df.year==1957, :]
y1957_mean = y1957.lifeExp.mean()
y1957_mean

51.50740112676056

In [6]:
y1962 = df.loc[df.year==1962, :]
y1962_mean = y1962.lifeExp.mean()
y1962_mean

53.609249014084504

In [7]:
y1967 = df.loc[df.year==1967, :]
y1967_mean = y1967.lifeExp.mean()
y1967_mean

55.678289577464795

In [8]:
y1972 = df.loc[df.year==1972, :]
y1972_mean = y1972.lifeExp.mean()
y1972_mean

57.64738647887324

In [9]:
y1977 = df.loc[df.year==1977, :]
y1977_mean = y1977.lifeExp.mean()
y1977_mean

59.57015746478874

In [10]:
y1982 = df.loc[df.year==1982, :]
y1982_mean = y1982.lifeExp.mean()
y1982_mean

61.53319718309859

In [11]:
y1987 = df.loc[df.year==1987, :]
y1987_mean = y1987.lifeExp.mean()
y1987_mean

63.21261267605633

In [12]:
y1992 = df.loc[df.year==1992, :]
y1992_mean = y1992.lifeExp.mean()
y1992_mean

64.16033802816901

In [13]:
y1997 = df.loc[df.year==1997, :]
y1997_mean = y1997.lifeExp.mean()
y1997_mean

65.01467605633802

In [14]:
y2002 = df.loc[df.year==2002, :]
y2002_mean = y2002.lifeExp.mean()
y2002_mean

65.69492253521126

In [15]:
y2007 = df.loc[df.year==2007, :]
y2007_mean = y2007.lifeExp.mean()
y2007_mean

67.00742253521126

In [16]:
df2 = pd.DataFrame({"year":[1952,1957,1962,2007], "":[y1952_mean, y1957_mean, y1962_mean, y2007_mean]})
df2

   year
0  1952  49.057620
1  1957  51.507401
2  1962  53.609249
3  2007  67.007423

In [17]:
# 사용자 함수와 groupby 메서드 조합하려면 agg메서드 사용해야함. 
def my_mean(values):
    n = len(values)
    sum =0
    for value in values:
        sum += value
    return sum / n

In [18]:
agg_my_mean = df.groupby('year').lifeExp.agg(my_mean)
agg_my_mean

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [19]:
# 2개의 인자값을 받아 처리하는 사용자함수와 groupby 메서드
def my_mean_diff(values, diff_value):
    n = len(values)
    sum = 0
    for value in values:
        sum += value
    mean = sum /n
    return mean-diff_value

In [20]:
global_mean = df.lifeExp.mean()
global_mean

59.474439366197174

In [21]:
agg_my_mean = df.groupby('year').lifeExp.agg(my_mean_diff, diff_value = global_mean)
agg_my_mean

year
1952   -10.416820
1957    -7.967038
1962    -5.865190
1967    -3.796150
1972    -1.827053
1977     0.095718
1982     2.058758
1987     3.738173
1992     4.685899
1997     5.540237
2002     6.220483
2007     7.532983
Name: lifeExp, dtype: float64

In [22]:
# 집계메서드를 리스트, 딕셔너리에 담아 전달하기
import numpy as np

In [23]:
gdf =df.groupby('year').lifeExp.agg([np.count_nonzero, np.mean, np.std])
gdf

      count_nonzero       mean        std
year
1952          142.0  49.057620  12.225956
1957          142.0  51.507401  12.231286
1962          142.0  53.609249  12.097245
1967          142.0  55.678290  11.718858
1972          142.0  57.647386  11.381953
1977          142.0  59.570157  11.227229
1982          142.0  61.533197  10.770618
1987          142.0  63.212613  10.556285
1992          142.0  64.160338  11.227380
1997          142.0  65.014676  11.559439
2002          142.0  65.694923  12.279823
2007          142.0  67.007423  12.073021

In [24]:
# 집계메서드를 딕셔너리에 담아 agg메서드에 전달
gdf_dict = df.groupby('year').agg({'lifeExp':'mean','pop':'median','gdpPercap':'median'})
gdf_dict

        lifeExp         pop    gdpPercap
year
1952  49.057620   3943953.0  1968.528344
1957  51.507401   4282942.0  2173.220291
1962  53.609249   4686039.5  2335.439533
1967  55.678290   5170175.5  2678.334741
1972  57.647386   5877996.5  3339.129407
1977  59.570157   6404036.5  3798.609244
1982  61.533197   7007320.0  4216.228428
1987  63.212613   7774861.5  4280.300366
1992  64.160338   8688686.5  4386.085502
1997  65.014676   9735063.5  4781.825478
2002  65.694923  10372918.5  5319.804524
2007  67.007423  10517531.0  6124.371109

In [25]:
# 11-2 데이터 변환
#평균 - 표준편차 = 표준점수
# 변환한데이터의 평균값은 0이되고 표준편차는 1이됨. 
def my_zscore(x):
    return (x -x.mean()) / x.std()

In [26]:
transform_z = df.groupby('year').lifeExp.transform(my_zscore)
transform_z.head()

0   -1.656854
1   -1.731249
2   -1.786543
3   -1.848157
4   -1.894173
Name: lifeExp, dtype: float64

In [27]:
# my_zscore함수는 데이터를 표준화할뿐 집계를 하지 않으므로 데이터의 양이 줄어들지않음
print(df.shape)
print(transform_z.shape)

(1704, 6)
(1704,)

In [28]:
#누락값을 평균으로 처리하기
import seaborn as sns
import numpy as np

np.random.seed(42)
tips_10 = sns.load_dataset('tips').sample(10) #tips에서 10개 추출
tips_10.loc[np.random.permutation(tips_10.index)[:4], 'total_bill'] = np.NaN #10개의 인덱스 중 4개를 임의로 선택하여 누락값으로 변경
tips_10

     total_bill   tip     sex smoker   day    time  size
24        19.82  3.18    Male     No   Sat  Dinner     2
6          8.77  2.00    Male     No   Sun  Dinner     2
153         NaN  2.00    Male     No   Sun  Dinner     4
211         NaN  5.16    Male    Yes   Sat  Dinner     4
198         NaN  2.00  Female    Yes  Thur   Lunch     2
176         NaN  2.00    Male    Yes   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [29]:
count_sex=tips_10.groupby('sex').count()
count_sex

        total_bill  tip  smoker  day  time  size
sex
Male             4    7       7    7     7     7
Female           2    3       3    3     3     3

In [30]:
#성별을 구분하여 total_bill열의 데이터를 받아 평균값을 구하는 함수
def fill_na_mean(x):
    avg = x.mean()
    return x.fillna(avg)

In [31]:
total_bill_group_mena = tips_10.groupby('sex').total_bill.transform(fill_na_mean)
tips_10['fill_total_bill'] = total_bill_group_mena
tips_10

     total_bill   tip     sex smoker   day    time  size  fill_total_bill
24        19.82  3.18    Male     No   Sat  Dinner     2          19.8200
6          8.77  2.00    Male     No   Sun  Dinner     2           8.7700
153         NaN  2.00    Male     No   Sun  Dinner     4          17.9525
211         NaN  5.16    Male    Yes   Sat  Dinner     4          17.9525
198         NaN  2.00  Female    Yes  Thur   Lunch     2          13.9300
176         NaN  2.00    Male    Yes   Sun  Dinner     2          17.9525
192       28.44  2.56    Male    Yes  Thur   Lunch     2          28.4400
124       12.48  2.52  Female     No  Thur   Lunch     2          12.4800
9         14.78  3.23    Male     No   Sun  Dinner     2          14.7800
101       15.38  3.00  Female    Yes   Fri  Dinner     2          15.3800

# 11-3 데이터 필터링

In [32]:
# 데이터 크기 확인
tips = sns.load_dataset('tips')
tips.shape

(244, 7)

In [33]:
# 데이터 수 확인
# 1,5,6 테이블의 데이터 수가 적음을 확인
tips['size'].value_counts()

2    156
3     38
4     37
5      5
6      4
1      4
Name: size, dtype: int64

In [34]:
# 이런 경우 1,5,6 의 데이터는 제외할 수 있음
tips_filtered = tips.\
groupby('size').\
filter(lambda x: x['size'].count()>=30)

In [35]:
print(tips_filtered.shape)
print(tips_filtered['size'].value_counts())

(231, 7)
2    156
3     38
4     37
Name: size, dtype: int64

In [36]:
# 11-4 그룹 오브wprxm
tips_10 = sns.load_dataset('tips').sample(10, random_state =42)
tips_10

     total_bill   tip     sex smoker   day    time  size
24        19.82  3.18    Male     No   Sat  Dinner     2
6          8.77  2.00    Male     No   Sun  Dinner     2
153       24.55  2.00    Male     No   Sun  Dinner     4
211       25.89  5.16    Male    Yes   Sat  Dinner     4
198       13.00  2.00  Female    Yes  Thur   Lunch     2
176       17.89  2.00    Male    Yes   Sun  Dinner     2
192       28.44  2.56    Male    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
9         14.78  3.23    Male     No   Sun  Dinner     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [37]:
#오브젝트임을 확안
grouped = tips_10.groupby('sex')
grouped

In [38]:
# 그룹 오브젝트에 포함된 그룹을 보려면 groups 속성을 보면됨. 
grouped.groups

{'Male': Int64Index([24, 6, 153, 211, 176, 192, 9], dtype='int64'),
 'Female': Int64Index([198, 124, 101], dtype='int64')}

In [39]:
# 한번에 그룹 오브젝트하기
# 파이썬은 그룹 연산에 적합한 열만 추출해서 자동으로 연산을 해주는 기능이 있음 
avgs = grouped.mean()
avgs

        total_bill       tip      size
sex
Male         20.02  2.875714  2.571429
Female       13.62  2.506667  2.000000

In [40]:
tips_10.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [41]:
#그룹 오브젝트에서 데이터 추출하고 반복하기
female = grouped.get_group('Female')
female

     total_bill   tip     sex smoker   day    time  size
198       13.00  2.00  Female    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2

In [42]:
for sex_group in grouped:
    print(sex_group)

('Male',      total_bill   tip   sex smoker   day    time  size
24        19.82  3.18  Male     No   Sat  Dinner     2
6          8.77  2.00  Male     No   Sun  Dinner     2
153       24.55  2.00  Male     No   Sun  Dinner     4
211       25.89  5.16  Male    Yes   Sat  Dinner     4
176       17.89  2.00  Male    Yes   Sun  Dinner     2
192       28.44  2.56  Male    Yes  Thur   Lunch     2
9         14.78  3.23  Male     No   Sun  Dinner     2)
('Female',      total_bill   tip     sex smoker   day    time  size
198       13.00  2.00  Female    Yes  Thur   Lunch     2
124       12.48  2.52  Female     No  Thur   Lunch     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2)

In [43]:
for sex_group in grouped:
    print('the type is: {}\n'.format(type(sex_group)))
    print('the length is: {}\n'.format(len(sex_group)))

    first_element = sex_group[0]
    print('the first is: {}\n'.format(type(first_element)))
    print('it has a type of: {}\n'.format(len(first_element)))
    
    second_element = sex_group[1]
    print('the second is: \n{}\n'.format(type(second_element)))
    print('it has a type of: {}\n'.format(len(second_element)))
    
    print('wha we have')
    print(sex_group)
    
    break

the type is: <class 'tuple'>

the length is: 2

the first is: <class 'str'>

it has a type of: 4

the second is:
<class 'pandas.core.frame.DataFrame'>

it has a type of: 7

wha we have
('Male',      total_bill   tip   sex smoker   day    time  size
24        19.82  3.18  Male     No   Sat  Dinner     2
6          8.77  2.00  Male     No   Sun  Dinner     2
153       24.55  2.00  Male     No   Sun  Dinner     4
211       25.89  5.16  Male    Yes   Sat  Dinner     4
176       17.89  2.00  Male    Yes   Sun  Dinner     2
192       28.44  2.56  Male    Yes  Thur   Lunch     2
9         14.78  3.23  Male     No   Sun  Dinner     2)

In [44]:
#여러열을 사용해서 그룹 오브젝트를 만들고 계산하기
bill_sex_time =tips_10.groupby(['sex','time'])
group_avg = bill_sex_time.mean()
group_avg

               total_bill       tip      size
sex    time
Male   Lunch    28.440000  2.560000  2.000000
       Dinner   18.616667  2.928333  2.666667
Female Lunch    12.740000  2.260000  2.000000
       Dinner   15.380000  3.000000  2.000000

In [45]:
print(type(group_avg))
print(group_avg.columns)
print(group_avg.index)

<class 'pandas.core.frame.DataFrame'>
Index(['total_bill', 'tip', 'size'], dtype='object')
MultiIndex(levels=[['Male', 'Female'], ['Lunch', 'Dinner']],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]],
           names=['sex', 'time'])

In [46]:
#데이터 프레임의 인덱스가 multiindex인 경우 reset_index메서드를 사용하여 데이터 프레임의 인덱스를 새로 부여할 수 있음
group_method = tips_10.groupby(['sex','time']).mean().reset_index()
group_method

      sex    time  total_bill       tip      size
0    Male   Lunch   28.440000  2.560000  2.000000
1    Male  Dinner   18.616667  2.928333  2.666667
2  Female   Lunch   12.740000  2.260000  2.000000
3  Female  Dinner   15.380000  3.000000  2.000000

In [47]:
#reset_index 대신에 as_index 사용해서 False로 설정해도 같은 값을 받을 수 있음
group_method = tips_10.groupby(['sex','time'],as_index=False).mean()
group_method

      sex    time  total_bill       tip      size
0    Male   Lunch   28.440000  2.560000  2.000000
1    Male  Dinner   18.616667  2.928333  2.666667
2  Female   Lunch   12.740000  2.260000  2.000000
3  Female  Dinner   15.380000  3.000000  2.000000